In [173]:
#Import necessary modules
#Predict whether a person survived the titanic or not based on Pclass, Sex, Age, and Fare
#Pick a model that is best for this problem
import pandas as pd
from sklearn.preprocessing import LabelEncoder
from sklearn import tree

In [174]:
#read the csv file and show the first 5 rows of the dataset
df = pd.read_csv('/Users/leahsumajit/Downloads/py-master/ML/9_decision_tree/Exercise/titanic.csv')
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [175]:
#Drop unecessary columns and assign a variable to the target variable
columns_to_drop = ['Survived','PassengerId', 'Name', 'SibSp', 'Parch', 'Ticket', 'Cabin', 'Embarked']
inputs = df.drop(columns = columns_to_drop, axis = 1)
target = df['Survived']

In [176]:
#show the first 5 rows of the independent variables 
inputs.head()

   Pclass     Sex   Age     Fare
0       3    male  22.0   7.2500
1       1  female  38.0  71.2833
2       3  female  26.0   7.9250
3       1  female  35.0  53.1000
4       3    male  35.0   8.0500

In [177]:
#show the first 5 rows of the target variable/dependent variable
target.head()

0    0
1    1
2    1
3    1
4    0
Name: Survived, dtype: int64

In [178]:
#Use LabelEncoder to convert strings into numerical labels
le_sex = LabelEncoder()

In [179]:
#Change column 'Sex' into numerical values
inputs['sex_n'] = le_sex.fit_transform(inputs['Sex'])
inputs.head()

   Pclass     Sex   Age     Fare  sex_n
0       3    male  22.0   7.2500      1
1       1  female  38.0  71.2833      0
2       3  female  26.0   7.9250      0
3       1  female  35.0  53.1000      0
4       3    male  35.0   8.0500      1

In [180]:
#Drop the column with the string values
inputs_n = inputs.drop(['Sex'], axis = 'columns')
inputs_n.head()

   Pclass   Age     Fare  sex_n
0       3  22.0   7.2500      1
1       1  38.0  71.2833      0
2       3  26.0   7.9250      0
3       1  35.0  53.1000      0
4       3  35.0   8.0500      1

In [181]:
#Check any NaNs
inputs_n.isna().sum()

Pclass      0
Age       177
Fare        0
sex_n       0
dtype: int64

In [182]:
#Fill any NaNs from the dataset
inputs_n.Age = inputs_n.Age.fillna(inputs_n.Age.mean())
inputs_n.head()

   Pclass   Age     Fare  sex_n
0       3  22.0   7.2500      1
1       1  38.0  71.2833      0
2       3  26.0   7.9250      0
3       1  35.0  53.1000      0
4       3  35.0   8.0500      1

In [183]:
#Again, check if there are any NaNs left
inputs_n.isna().sum()

Pclass    0
Age       0
Fare      0
sex_n     0
dtype: int64

In [184]:
#Split your data into training and testing
X_train, X_test, Y_train, Y_test = train_test_split(inputs_n, target, test_size = 0.2, random_state = 42)

In [185]:
#find the length of your training data
len(X_train)

712

In [186]:
#find the length of your testing data
len(X_test)

179

In [187]:
#Pick your model 
model = tree.DecisionTreeClassifier()

In [188]:
#fit your splitted training data into your model
model.fit(X_train, Y_train)

DecisionTreeClassifier()

In [189]:
#make a prediction 
y_pred = model.predict(X_test)

In [190]:
# Evaluate the model's accuracy
accuracy = accuracy_score(Y_test, y_pred)
print(f"Accuracy: {accuracy}")

Accuracy: 0.7653631284916201